{
    "items": [
        {
            "id": "room_237_key",
            "name": "Room 237 Key",
            "description": "a tarnished brass key labeled 'Room 237'. It feels unnaturally cold to the touch, sending a shiver down your spine as if warning you of the horrors that lie behind the door it unlocks.",
            "shortDescription": "a tarnished brass key labeled 'Room 237'",
            "weight": "2kg",
            "isOpenable": false
        },
        {
            "id": "typewriter",
            "name": "Typewriter",
            "description": "jack's typewriter, an ancient, heavy machine that clatters ominously with every keystroke. The paper loaded in it is filled with the repeated phrase 'All work and no play makes Jack a dull boy,' written obsessively in a neat, yet frantic hand.",
            "shortDescription": "jack's typewriter, an ancient, heavy machine that clatters ominously with every keystroke",
            "weight": "20kg",
            "isOpenable": false
        },
        {
            "id": "croquet_mallet",
            "name": "Croquet Mallet",
            "description": "a solid wooden croquet mallet, its handle worn smooth by countless hands. The head is dented and scratched, bearing the scars of violent impacts, hinting at a more sinister past than simple garden games.",
            "shortDescription": "a solid wooden croquet mallet, its handle worn smooth by countless hands",
            "weight": "5kg",
            "isOpenable": false
        },
        {
            "id": "whiskey_bottle",
            "name": "Whiskey Bottle",
            "description": "a half-empty bottle of Jack Daniel's whiskey. The amber liquid inside sloshes lazily, and the bottle itself is smudged with fingerprints, as if clutched tightly during moments of despair and madness.",
            "shortDescription": "a half-empty bottle of Jack Daniel's whiskey",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "kitchen_knife",
            "name": "Kitchen Knife",
            "description": "a large, razor-sharp kitchen knife. The blade gleams menacingly in the dim light, reflecting distorted images of your surroundings. It's the kind of knife that feels more suited to sinister purposes than culinary arts.",
            "shortDescription": "a large, razor-sharp kitchen knife",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "axe",
            "name": "Axe",
            "description": "a massive, double-headed axe with a wickedly sharp edge. Its weight and balance suggest it could cleave through more than just wood, evoking images of brutal violence and chilling echoes of screams.",
            "shortDescription": "a massive, double-headed axe with a wickedly sharp edge",
            "weight": "7kg",
            "isOpenable": false
        },
        {
            "id": "family_photo",
            "name": "Family Photo",
            "description": "a dusty framed photo of Jack, Wendy, and Danny, smiling together in happier times. The glass is cracked, and there is something unnerving about their eyes, as if they know their fate and are silently pleading for help.",
            "shortDescription": "a dusty framed photo of Jack, Wendy, and Danny, smiling together in happier times",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "medicine_bottle",
            "name": "Medicine Bottle",
            "description": "a small amber bottle filled with pills prescribed to Danny. The label bears a stark warning of severe side effects, hinting at the fragility of his mental state and the dire consequences of neglecting his medication.",
            "shortDescription": "a small amber bottle filled with pills prescribed to Danny",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "radio",
            "name": "Radio",
            "description": "a battered, portable radio that crackles with static. It offers a faint hope of contacting the outside world, but its unreliable reception makes every attempt to call for help a nerve-wracking gamble.",
            "shortDescription": "a battered, portable radio that crackles with static",
            "weight": "3kg",
            "isOpenable": true
        },
        {
            "id": "snowshoes",
            "name": "Snowshoes",
            "description": "a pair of large, sturdy snowshoes, essential for traversing the treacherous, snow-covered grounds surrounding the Overlook Hotel. Their presence suggests the possibility of escape, but also the perilous journey required to achieve it.",
            "shortDescription": "a pair of large, sturdy snowshoes, essential for traversing the treacherous, snow-covered grounds surrounding the Overlook Hotel",
            "weight": "2kg",
            "isOpenable": false
        },
        {
            "id": "flashlight",
            "name": "Flashlight",
            "description": "a heavy-duty, battery-operated flashlight that cuts through the darkness with a piercing beam. Its light is a beacon of hope in the oppressive gloom, but the batteries are starting to run low, casting flickering shadows that play tricks on your mind.",
            "shortDescription": "a heavy-duty, battery-operated flashlight that cuts through the darkness with a piercing beam",
            "weight": "2kg",
            "isOpenable": true
        },
        {
            "id": "bat",
            "name": "Baseball Bat",
            "description": "a solid wooden baseball bat, its surface nicked and scratched from countless impacts. It feels reassuringly sturdy in your hands, offering a sense of protection against the unknown threats lurking in the shadows.",
            "shortDescription": "a solid wooden baseball bat, its surface nicked and scratched from countless impacts",
            "weight": "3kg",
            "isOpenable": false
        },
        {
            "id": "hotel_ledger",
            "name": "Hotel Ledger",
            "description": "the Overlook Hotel's guest ledger, a heavy tome filled with the names of previous guests. Many of the entries are accompanied by ominous notes and mysterious symbols, hinting at the hotel's dark history and the fates that befell those who stayed here.",
            "shortDescription": "the Overlook Hotel's guest ledger, a heavy tome filled with the names of previous guests",
            "weight": "2kg",
            "isOpenable": true
        },
        {
            "id": "shining_book",
            "name": "The Shining Book",
            "description": "an old, leather-bound book filled with detailed accounts of supernatural abilities known as 'The Shining.' Its pages are filled with disturbing illustrations and ominous warnings, making it both a source of knowledge and a harbinger of dread.",
            "shortDescription": "an old, leather-bound book filled with detailed accounts of supernatural abilities known as 'The Shining'",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "hotel_map",
            "name": "Hotel Map",
            "description": "a detailed map of the Overlook Hotel, showing every room, corridor, and hidden passage. Its precise markings and annotations suggest it was drawn by someone with an intimate knowledge of the hotel's secrets.",
            "shortDescription": "a detailed map of the Overlook Hotel, showing every room, corridor, and hidden passage",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "danny's_toy",
            "name": "Danny's Toy Car",
            "description": "a small red toy car that belongs to Danny. Its bright color stands out starkly against the grim surroundings, a poignant symbol of innocence amidst the encroaching darkness.",
            "shortDescription": "a small red toy car that belongs to Danny",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "mysterious_note",
            "name": "Mysterious Note",
            "description": "a yellowed, crumpled note left by a previous guest. Its hastily scrawled message warns of the unspeakable horrors within Room 237, urging whoever finds it to stay away at all costs.",
            "shortDescription": "a yellowed, crumpled note left by a previous guest",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "hotel_chef_hat",
            "name": "Chef's Hat",
            "description": "a pristine white chef's hat worn by the Overlook Hotel's head chef. It carries the faint scent of cooked meals and a hint of something less savory, suggesting a hidden story behind its immaculate appearance.",
            "shortDescription": "a pristine white chef's hat worn by the Overlook Hotel's head chef",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "snowcat_engine_part",
            "name": "Snowcat Engine Part",
            "description": "a crucial, greasy engine part needed to repair the snowcat. Its weight and appearance convey its importance, as well as the difficulty and danger involved in obtaining and installing it.",
            "shortDescription": "a crucial, greasy engine part needed to repair the snowcat",
            "weight": "8kg",
            "isOpenable": false
        },
        {
            "id": "toolbox",
            "name": "Toolbox",
            "description": "a heavy metal toolbox filled with an assortment of tools necessary for various repairs. Its contents rattle ominously, each tool potentially a means of survival or a weapon in desperate hands.",
            "shortDescription": "a heavy metal toolbox filled with an assortment of tools necessary for various repairs",
            "weight": "10kg",
            "isOpenable": true,
            "items": [
                "wrench", "screwdriver"
            ]
        },
        {
            "id": "wrench",
            "name": "Wrench",
            "description": "a large, adjustable wrench, its jaws capable of gripping and turning stubborn bolts. It feels cold and solid in your hand, ready to be used for mechanical repairs or as a makeshift weapon.",
            "shortDescription": "a large, adjustable wrench, its jaws capable of gripping and turning stubborn bolts",
            "weight": "2kg",
            "isOpenable": false
        },
        {
            "id": "screwdriver",
            "name": "Screwdriver",
            "description": "a flat-head screwdriver, its tip worn from frequent use. It's an essential tool for any repair job, but also a reminder of the thin line between construction and destruction.",
            "shortDescription": "a flat-head screwdriver, its tip worn from frequent use",
            "weight": "2kg",
            "isOpenable": false
        },
        {
            "id": "snowcat_manual",
            "name": "Snowcat Repair Manual",
            "description": "the Snowcat Repair Manual. \n---------------------------\nThese are items needed to repair the snowcat: \n1.Snowcat Engine Part \n2.Screwdriver \n3.Fuel Can \n4.Wires \n5.Battery",
            "shortDescription": "a thick, detailed manual filled with diagrams and instructions on how to repair the snowcat",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "fuel_can",
            "name": "Fuel Can",
            "description": "a heavy canister of fuel for the snowcat. It sloshes ominously when moved, each step with it echoing the dire need for escape and the dangerous journey ahead.",
            "shortDescription": "a heavy canister of fuel for the snowcat",
            "weight": "5kg",
            "isOpenable": false
        },
        {
            "id": "wires",
            "name": "Wires",
            "description": "a tangled mess of frayed electrical wires, their exposed copper glinting dangerously. They might be useful to fix a telephone ... or a snowcat",
            "shortDescription": "a tangled mess of frayed electrical wires",
            "weight": "1kg",
            "isOpenable": false
        },
        {
            "id": "battery",
            "name": "Battery",
            "description": "a corroded, heavy-duty battery, its surface pitted with age and misuse. It holds a faint charge, just enough to power a snowcat...",
            "shortDescription": "a corroded, heavy-duty battery",
            "weight": "5kg",
            "isOpenable": false
        },
        {
            "id": "snowcat",
            "name": "Snowcat",
            "description": "a large, tracked vehicle designed for navigating through deep snow. Its exterior is battered and covered in a layer of frost, but it represents a potential lifeline for escaping the isolation of the Overlook Hotel. However, it looks like it might need some repairs before it can be used.",
            "shortDescription": "a large, tracked vehicle in need of repair, designed for navigating through deep snow",
            "weight": "300kg",
            "isOpenable": true
        },
        {
            "id": "telephone",
            "name": "Telephone",
            "description": "an old-fashioned rotary telephone with a heavy, black handset. The dial is stiff and the line crackles with static, making it unreliable for communication. There seems to be wires poking out from the back...",
            "shortDescription": "an old-fashioned rotary telephone with a heavy, black handset",
            "weight": "3kg",
            "isOpenable": false,
            "items": [
                "wires"
            ]
        },
        {
            "id": "circuit",
            "name": "Circuit",
            "description": "a faded circuit breaker with switches, once sturdy and dependable, that now creak with resistance at the slightest touch, as if reluctant to awaken from their slumber.",
            "shortDescription": "a faded cicuit breaker with creaky switches",
            "weight": "15kg",
            "isOpenable": true,
            "items": [
                "switches"
            ]
        },
        {
            "id": "manual_key_paper",
            "name": "Manual Key Paper",
            "description": "an unnerving note written by you while semi conscious. Looking at the note makes you confused and scared but you feel it may be important",
            "shortDescription": "a special note written while semi conscious",
            "weight": "1kg",
            "isOpenable": true
        },
        {
            "id": "chest",
            "name": "Chest",
            "description": "A rustic chest with the words \"knlwuayrlo o o lbdyp\" etched on the top. The front of the chest holds what seems to be a place to input letters.",
            "shortDescription": "a rustic chest with scrambled words that seem as though they hint to something",
            "weight": "5kg",
            "isOpenable": false,
            "items": [
                "snowcat_manual"
            ]
        },
        {
            "id": "switches",
            "name": "Chest",
            "description": "worn out switches that seem as if they are long overdue to be replaced. You see the paint has been scratched off through years of being in the hotel",
            "shortDescription": "worn out switches that are all pointing the wrong direction",
            "weight": "10kg",
            "isOpenable": false
        },
        {
            "id": "ice_block",
            "name": "Ice Block",
            "description": "a large block of ice that looks to have been built up over multiple years, you wonder what could possibly be hiding behind the large block of ice.",
            "shortDescription": "a large block of ice that seems to be hiding something special behind it",
            "weight": "30kg",
            "isOpenable": false
        }
    ]
}
  